espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_struct.h
/** Group: HP TCM RDN ECO CS REG */
/** Type of tcm_rdn_eco_cs register
 *  NA
 */
typedef union {
    struct {
        /** reg_hp_system_tcm_rdn_eco_en : R/W; bitpos: [0]; default: 0;
         *  NA
         */
        uint32_t reg_hp_system_tcm_rdn_eco_en:1;
        /** reg_hp_system_tcm_rdn_eco_result : RO; bitpos: [1]; default: 0;
         *  NA
         */
        uint32_t reg_hp_system_tcm_rdn_eco_result:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_tcm_rdn_eco_cs_reg_t;


/** Group: HP TCM RDN ECO LOW REG */
/** Type of tcm_rdn_eco_low register
 *  NA
 */
typedef union {
    struct {
        /** reg_hp_system_tcm_rdn_eco_low : R/W; bitpos: [31:0]; default: 0;
         *  NA
         */
        uint32_t reg_hp_system_tcm_rdn_eco_low:32;
    };
    uint32_t val;
} hp_system_tcm_rdn_eco_low_reg_t;


/** Group: HP TCM RDN ECO HIGH REG */
/** Type of tcm_rdn_eco_high register
 *  NA
 */
typedef union {
    struct {
        /** reg_hp_system_tcm_rdn_eco_high : R/W; bitpos: [31:0]; default: 4294967295;
         *  NA
         */
        uint32_t reg_hp_system_tcm_rdn_eco_high:32;
    };
    uint32_t val;
} hp_system_tcm_rdn_eco_high_reg_t;


/** Group: HP CACHE PWR CTRL REG */
/** Type of cache_pwr_ctrl register
 *  NA
 */
typedef union {
    struct {
        /** reg_ac_mem_fo : R/W; bitpos: [7:0]; default: 0;
         *  need_des
         */
        uint32_t reg_ac_mem_fo:8;
        /** reg_ic_mem_fo : R/W; bitpos: [15:8]; default: 0;
         *  need_des
         */
        uint32_t reg_ic_mem_fo:8;
        /** reg_dc_mem_fo : R/W; bitpos: [23:16]; default: 0;
         *  need_des
         */
        uint32_t reg_dc_mem_fo:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} hp_system_cache_pwr_ctrl_reg_t;


/** Group: HP_TCM_DATA_DUMP_CTRL_REG */
/** Type of tcm_data_dump_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** tcm_data_dump_en : R/W; bitpos: [31:0]; default: 0;
         *  hp tcm_data dump switch
         */
        uint32_t tcm_data_dump_en:32;
    };
    uint32_t val;
} hp_system_tcm_data_dump_ctrl_reg_t;


/** Group: Configuration Register */
/** Type of cpu_waiti_conf register
 *  CPU_WAITI configuration register
 */
typedef union {
    struct {
        /** cpu_wait_mode_force_on : R/W; bitpos: [0]; default: 1;
         *  Set 1 to force cpu_waiti_clk enable.
         */
        uint32_t cpu_wait_mode_force_on:1;
        /** cpu_waiti_delay_num : R/W; bitpos: [4:1]; default: 0;
         *  This field used to set delay cycle when cpu enter waiti mode, after delay waiti_clk
         *  will close
         */
        uint32_t cpu_waiti_delay_num:4;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} hp_system_cpu_waiti_conf_reg_t;

/** Type of sys_core_debug_runstall_conf register
 *  Core Debug runstall configure register
 */
typedef union {
    struct {
        /** sys_core_debug_runstall_enable : R/W; bitpos: [0]; default: 0;
         *  Set this field to 1 to enable debug runstall feature between HP-core and LP-core.
         */
        uint32_t sys_core_debug_runstall_enable:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_system_core_debug_runstall_conf_reg_t;

/** Type of core_pad_wakeup_event register
 *  pad wakeup event register
 */
typedef union {
    struct {
        /** core0_pad_wakeup_event : R/W; bitpos: [0]; default: 0;
         *  wakeup core0 register
         */
        uint32_t core0_pad_wakeup_event:1;
        /** core1_pad_wakeup_event : R/W; bitpos: [1]; default: 0;
         *  wakeup core1 register
         */
        uint32_t core1_pad_wakeup_event:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_core_pad_wakeup_event_reg_t;

/** Type of twai0_timestamp_l register
 *  twai0 timestamp low bit reg
 */
typedef union {
    struct {
        /** twai0_timestamp_i : R/W; bitpos: [31:0]; default: 4294967295;
         *  This field used to set lower 32bits of timestamp hp twai0
         */
        uint32_t twai0_timestamp_i:32;
    };
    uint32_t val;
} hp_system_twai0_timestamp_l_reg_t;

/** Type of twai0_timestamp_h register
 *  twai0 timestamp high bit reg
 */
typedef union {
    struct {
        /** twai0_timestamp_h : R/W; bitpos: [31:0]; default: 4294967295;
         *  This field used to set upper 32bits of timestamp hp twai0
         */
        uint32_t twai0_timestamp_h:32;
    };
    uint32_t val;
} hp_system_twai0_timestamp_h_reg_t;

/** Type of twai1_timestamp_l register
 *  twai1 timestamp low bit reg
 */
typedef union {
    struct {
        /** twai1_timestamp_i : R/W; bitpos: [31:0]; default: 4294967295;
         *  This field used to set lower 32bits of timestamp hp twai1
         */
        uint32_t twai1_timestamp_i:32;
    };
    uint32_t val;
} hp_system_twai1_timestamp_l_reg_t;

/** Type of twai1_timestamp_h register
 *  twai1 timestamp high bit reg
 */
typedef union {
    struct {
        /** twai1_timestamp_h : R/W; bitpos: [31:0]; default: 4294967295;
         *  This field used to set upper 32bits of timestamp hp twai1
         */
        uint32_t twai1_timestamp_h:32;
    };
    uint32_t val;
} hp_system_twai1_timestamp_h_reg_t;

/** Type of rng_cfg register
 *  rng cfg register
 */
typedef union {
    struct {
        uint32_t reserved_0:16;
        /** rng_chain_clk_div_num : R/W; bitpos: [23:16]; default: 0;
         *  chain clk div num to pad for debug
         */
        uint32_t rng_chain_clk_div_num:8;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} hp_system_rng_cfg_reg_t;

/** Type of peri_mem_clk_force_on register
 *  hp peri mem clk force on regpster
 */
typedef union {
    struct {
        /** rmt_mem_clk_force_on : R/W; bitpos: [0]; default: 0;
         *  Set this bit to force on mem clk in rmt
         */
        uint32_t rmt_mem_clk_force_on:1;
        /** bitscrambler_tx_mem_clk_force_on : R/W; bitpos: [1]; default: 0;
         *  Set this bit to force on tx mem clk in bitscrambler
         */
        uint32_t bitscrambler_tx_mem_clk_force_on:1;
        /** bitscrambler_rx_mem_clk_force_on : R/W; bitpos: [2]; default: 0;
         *  Set this bit to force on rx mem clk in bitscrambler
         */
        uint32_t bitscrambler_rx_mem_clk_force_on:1;
        /** gdma_mem_clk_force_on : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force on mem clk in gdma
         */
        uint32_t gdma_mem_clk_force_on:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_peri_mem_clk_force_on_reg_t;

