espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_struct.h
/** Type of sys_prdyn_st register
 *  hp system prdyn status register
 */
typedef union {
    struct {
        uint32_t reserved_0:1;
        /** rom_prdyn : RO; bitpos: [1]; default: 1;
         *  record memory power status
         */
        uint32_t rom_prdyn:1;
        uint32_t reserved_2:1;
        /** cpu_mem_prdyn : RO; bitpos: [3]; default: 1;
         *  record memory power status
         */
        uint32_t cpu_mem_prdyn:1;
        /** bitscrambler_mem_prdyn : RO; bitpos: [4]; default: 1;
         *  record memory power status
         */
        uint32_t bitscrambler_mem_prdyn:1;
        uint32_t reserved_5:1;
        /** usb_mem_prdyn : RO; bitpos: [6]; default: 1;
         *  record memory power status
         */
        uint32_t usb_mem_prdyn:1;
        /** rmt_mem_prdyn : RO; bitpos: [7]; default: 1;
         *  record memory power status
         */
        uint32_t rmt_mem_prdyn:1;
        /** ledc0_mem_prdyn : RO; bitpos: [8]; default: 1;
         *  record memory power status
         */
        uint32_t ledc0_mem_prdyn:1;
        /** key_manager_mem_prdyn : RO; bitpos: [9]; default: 1;
         *  record memory power status
         */
        uint32_t key_manager_mem_prdyn:1;
        /** vpu_mem_prdyn : RO; bitpos: [10]; default: 1;
         *  record memory power status
         */
        uint32_t vpu_mem_prdyn:1;
        uint32_t reserved_11:1;
        /** gdma_mem_prdyn : RO; bitpos: [12]; default: 1;
         *  record memory power status
         */
        uint32_t gdma_mem_prdyn:1;
        uint32_t reserved_13:1;
        /** uart_mem_prdyn : RO; bitpos: [14]; default: 1;
         *  record memory power status
         */
        uint32_t uart_mem_prdyn:1;
        /** crypto_mem_prdyn : RO; bitpos: [15]; default: 1;
         *  record memory power status
         */
        uint32_t crypto_mem_prdyn:1;
        /** flash_mspi_mem_prdyn : RO; bitpos: [16]; default: 1;
         *  record memory power status
         */
        uint32_t flash_mspi_mem_prdyn:1;
        /** psram_mspi_mem_prdyn : RO; bitpos: [17]; default: 1;
         *  record memory power status
         */
        uint32_t psram_mspi_mem_prdyn:1;
        /** modem_mem_prdyn : RO; bitpos: [18]; default: 1;
         *  record memory power status
         */
        uint32_t modem_mem_prdyn:1;
        /** ledc1_mem_prdyn : RO; bitpos: [19]; default: 1;
         *  record memory power status
         */
        uint32_t ledc1_mem_prdyn:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} hp_system_prdyn_st_reg_t;

/** Type of sys_icm_cfg register
 *  hp system axi icm ctrl register
 */
typedef union {
    struct {
        /** sys_icm_dis_rd : R/W; bitpos: [2:0]; default: 0;
         *  0:mean master can access slave , 1:mean master can not rd slave ,will returen
         *  decerro on axi bus
         */
        uint32_t sys_icm_dis_rd:3;
        /** sys_icm_dis_wr : R/W; bitpos: [5:3]; default: 0;
         *  0:mean master can access slave , 1:mean master can not wr slave ,will returen
         *  decerro on axi bus
         */
        uint32_t sys_icm_dis_wr:3;
        /** sys_icm_cfg_secure : R/W; bitpos: [8:6]; default: 0;
         *  axi_matrix slave ,0: non-secure, 1: secure , total 3 slave.
         */
        uint32_t sys_icm_cfg_secure:3;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} hp_system_icm_cfg_reg_t;

/** Type of sys_uart3_mem_lp_ctrl register
 *  uart memory power control register
 */
typedef union {
    struct {
        /** sys_uart3_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures uart3 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_uart3_mem_lp_mode:2;
        /** sys_uart3_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down uart3 memory.
         */
        uint32_t sys_uart3_mem_lp_en:1;
        /** sys_uart3_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control uart3 memory, disable hardware control.
         */
        uint32_t sys_uart3_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_uart3_mem_lp_ctrl_reg_t;

/** Type of sys_rmt_mem_lp_ctrl register
 *  rmt memory power control register
 */
typedef union {
    struct {
        /** sys_rmt_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures rmt memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_rmt_mem_lp_mode:2;
        /** sys_rmt_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down rmt memory.
         */
        uint32_t sys_rmt_mem_lp_en:1;
        /** sys_rmt_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control rmt memory, disable hardware control.
         */
        uint32_t sys_rmt_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_rmt_mem_lp_ctrl_reg_t;

/** Type of sys_ledc0_mem_lp_ctrl register
 *  ledc0 memory power control register
 */
typedef union {
    struct {
        /** sys_ledc0_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures ledc0 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_ledc0_mem_lp_mode:2;
        /** sys_ledc0_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down ledc0 memory.
         */
        uint32_t sys_ledc0_mem_lp_en:1;
        /** sys_ledc0_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control ledc0 memory, disable hardware control.
         */
        uint32_t sys_ledc0_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_ledc0_mem_lp_ctrl_reg_t;

/** Type of sys_km_mem_lp_ctrl register
 *  key manager memory power control register
 */
typedef union {
    struct {
        /** sys_km_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures km memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_km_mem_lp_mode:2;
        /** sys_km_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down km memory.
         */
        uint32_t sys_km_mem_lp_en:1;
        /** sys_km_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control km memory, disable hardware control.
         */
        uint32_t sys_km_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_km_mem_lp_ctrl_reg_t;

/** Type of sys_dma2d_mem_lp_ctrl register
 *  vpu memory power control register
 */
typedef union {
    struct {
        /** sys_2ddma_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures 2ddma memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_2ddma_mem_lp_mode:2;
        /** sys_2ddma_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down 2ddma memory.
         */
        uint32_t sys_2ddma_mem_lp_en:1;
        /** sys_2ddma_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control 2ddma memory, disable hardware control.
         */
        uint32_t sys_2ddma_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_dma2d_mem_lp_ctrl_reg_t;

/** Type of sys_axi_pdma_mem_lp_ctrl register
 *  vpu memory power control register
 */
typedef union {
    struct {
        /** sys_axi_pdma_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures axi_pdma memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_axi_pdma_mem_lp_mode:2;
        /** sys_axi_pdma_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down axi_pdma memory.
         */
        uint32_t sys_axi_pdma_mem_lp_en:1;
        /** sys_axi_pdma_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control axi_pdma memory, disable hardware control.
         */
        uint32_t sys_axi_pdma_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_axi_pdma_mem_lp_ctrl_reg_t;

/** Type of sys_ecc_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_ecc_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures ecc memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_ecc_mem_lp_mode:2;
        /** sys_ecc_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down ecc memory.
         */
        uint32_t sys_ecc_mem_lp_en:1;
        /** sys_ecc_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control ecc memory, disable hardware control.
         */
        uint32_t sys_ecc_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_ecc_mem_lp_ctrl_reg_t;

/** Type of sys_rsa_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_rsa_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures rsa memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_rsa_mem_lp_mode:2;
        /** sys_rsa_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down rsa memory.
         */
        uint32_t sys_rsa_mem_lp_en:1;
        /** sys_rsa_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control rsa memory, disable hardware control.
         */
        uint32_t sys_rsa_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_rsa_mem_lp_ctrl_reg_t;

/** Type of sys_bitscram_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_bitscram_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures bitscram memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_bitscram_mem_lp_mode:2;
        /** sys_bitscram_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down bitscram memory.
         */
        uint32_t sys_bitscram_mem_lp_en:1;
        /** sys_bitscram_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control bitscram memory, disable hardware control.
         */
        uint32_t sys_bitscram_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_bitscram_mem_lp_ctrl_reg_t;

/** Type of sys_can0_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_can0_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures can0 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_can0_mem_lp_mode:2;
        /** sys_can0_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down can0 memory.
         */
        uint32_t sys_can0_mem_lp_en:1;
        /** sys_can0_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control can0 memory, disable hardware control.
         */
        uint32_t sys_can0_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_can0_mem_lp_ctrl_reg_t;

/** Type of sys_mspi_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_psram_mspi_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures psram_mspi memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_psram_mspi_mem_lp_mode:2;
        /** sys_psram_mspi_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down psram_mspi memory.
         */
        uint32_t sys_psram_mspi_mem_lp_en:1;
        /** sys_psram_mspi_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control psram_mspi memory, disable hardware control.
         */
        uint32_t sys_psram_mspi_mem_lp_force_ctrl:1;
        /** sys_flash_mspi_mem_lp_mode : R/W; bitpos: [5:4]; default: 2;
         *  Configures flash_mspi memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_flash_mspi_mem_lp_mode:2;
        /** sys_flash_mspi_mem_lp_en : R/W; bitpos: [6]; default: 0;
         *  Set this bit to power down flash_mspi memory.
         */
        uint32_t sys_flash_mspi_mem_lp_en:1;
        /** sys_flash_mspi_mem_lp_force_ctrl : R/W; bitpos: [7]; default: 0;
         *  Set this bit to force software control flash_mspi memory, disable hardware control.
         */
        uint32_t sys_flash_mspi_mem_lp_force_ctrl:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_system_mspi_mem_lp_ctrl_reg_t;

/** Type of sys_hpcore_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_hpcore_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures hpcore memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_hpcore_mem_lp_mode:2;
        /** sys_hpcore_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down hpcore memory.
         */
        uint32_t sys_hpcore_mem_lp_en:1;
        /** sys_hpcore_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control hpcore memory, disable hardware control.
         */
        uint32_t sys_hpcore_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_hpcore_mem_lp_ctrl_reg_t;

