espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_struct.h
/** Type of sys_rom_mem_lp_ctrl register
 *  rom power control register
 */
typedef union {
    struct {
        /** sys_rom_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures rom low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_rom_mem_lp_mode:2;
        /** sys_rom_mem_lp_en : R/W; bitpos: [3:2]; default: 0;
         *  Set this bit to power down rom.
         */
        uint32_t sys_rom_mem_lp_en:2;
        /** sys_rom_mem_lp_force_ctrl : R/W; bitpos: [5:4]; default: 0;
         *  Set this bit to force software control rom, disable hardware control.
         */
        uint32_t sys_rom_mem_lp_force_ctrl:2;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_rom_mem_lp_ctrl_reg_t;

/** Type of sys_l1_cache_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_l1_cache_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures l1_cache memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_l1_cache_mem_lp_mode:2;
        /** sys_l1_cache_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down l1_cache memory.
         */
        uint32_t sys_l1_cache_mem_lp_en:1;
        /** sys_l1_cache_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control l1_cache memory, disable hardware control.
         */
        uint32_t sys_l1_cache_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_l1_cache_mem_lp_ctrl_reg_t;

/** Type of sys_kyber_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_kyber_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures kyber memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_kyber_mem_lp_mode:2;
        /** sys_kyber_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down kyber memory.
         */
        uint32_t sys_kyber_mem_lp_en:1;
        /** sys_kyber_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control kyber memory, disable hardware control.
         */
        uint32_t sys_kyber_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_kyber_mem_lp_ctrl_reg_t;

/** Type of sys_lcdcam_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_lcdcam_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures lcdcam memory low power mode in low power stage.
         *  0: deep sleep
         *  1: light sleep
         *  2(default): shut down
         *  3: disable low power stage
         */
        uint32_t sys_lcdcam_mem_lp_mode:2;
        /** sys_lcdcam_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down lcdcam memory.
         */
        uint32_t sys_lcdcam_mem_lp_en:1;
        /** sys_lcdcam_mem_lp_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control lcdcam memory, disable hardware control.
         */
        uint32_t sys_lcdcam_mem_lp_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_lcdcam_mem_lp_ctrl_reg_t;

/** Type of sys_uart0_mem_lp_ctrl register
 *  uart memory power control register
 */
typedef union {
    struct {
        /** sys_uart0_mem_lp_mode : R/W; bitpos: [1:0]; default: 0;
         *  Configures uart0 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_uart0_mem_lp_mode:2;
        /** sys_uart0_mem_lp_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to power down uart0 memory.
         */
        uint32_t sys_uart0_mem_lp_en:1;
        /** sys_uart0_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control uart0 memory, disable hardware control.
         */
        uint32_t sys_uart0_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_uart0_mem_lp_ctrl_reg_t;

/** Type of sys_uart1_mem_lp_ctrl register
 *  uart memory power control register
 */
typedef union {
    struct {
        /** sys_uart1_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures uart1 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_uart1_mem_lp_mode:2;
        /** sys_uart1_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down uart1 memory.
         */
        uint32_t sys_uart1_mem_lp_en:1;
        /** sys_uart1_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control uart1 memory, disable hardware control.
         */
        uint32_t sys_uart1_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_uart1_mem_lp_ctrl_reg_t;

/** Type of sys_uart2_mem_lp_ctrl register
 *  uart memory power control register
 */
typedef union {
    struct {
        /** sys_uart2_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures uart2 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_uart2_mem_lp_mode:2;
        /** sys_uart2_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down uart2 memory.
         */
        uint32_t sys_uart2_mem_lp_en:1;
        /** sys_uart2_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control uart2 memory, disable hardware control.
         */
        uint32_t sys_uart2_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_uart2_mem_lp_ctrl_reg_t;

