espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_struct.h
/** Type of sys_ledc1_mem_lp_ctrl register
 *  ledc1 memory power control register
 */
typedef union {
    struct {
        /** sys_ledc1_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures ledc1 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_ledc1_mem_lp_mode:2;
        /** sys_ledc1_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down ledc1 memory.
         */
        uint32_t sys_ledc1_mem_lp_en:1;
        /** sys_ledc1_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control ledc1 memory, disable hardware control.
         */
        uint32_t sys_ledc1_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_ledc1_mem_lp_ctrl_reg_t;

/** Type of sys_ppa_mem_lp_ctrl register
 *  vpu memory power control register
 */
typedef union {
    struct {
        /** sys_ppa_sprf_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures ppa_sprf memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_ppa_sprf_mem_lp_mode:2;
        /** sys_ppa_sprf_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down ppa_sprf memory.
         */
        uint32_t sys_ppa_sprf_mem_lp_en:1;
        /** sys_ppa_sprf_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control ppa_sprf memory, disable hardware control.
         */
        uint32_t sys_ppa_sprf_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_ppa_mem_lp_ctrl_reg_t;

/** Type of sys_jpeg_mem_lp_ctrl register
 *  vpu memory power control register
 */
typedef union {
    struct {
        /** sys_jpeg_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures jpeg memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_jpeg_mem_lp_mode:2;
        /** sys_jpeg_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down jpeg memory.
         */
        uint32_t sys_jpeg_mem_lp_en:1;
        /** sys_jpeg_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control jpeg memory, disable hardware control.
         */
        uint32_t sys_jpeg_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_jpeg_mem_lp_ctrl_reg_t;

/** Type of sys_can1_mem_lp_ctrl register
 *  HP CORE0 & HP CORE1 memory power control register
 */
typedef union {
    struct {
        /** sys_can1_mem_lp_mode : R/W; bitpos: [1:0]; default: 2;
         *  Configures can1 memory low power mode in low power stage.
         *  0(default): deep sleep
         *  1: light sleep
         *  2: shut down
         *  3: disable low power stage
         */
        uint32_t sys_can1_mem_lp_mode:2;
        /** sys_can1_mem_lp_en : R/W; bitpos: [2]; default: 1;
         *  Set this bit to power down can1 memory.
         */
        uint32_t sys_can1_mem_lp_en:1;
        /** sys_can1_mem_force_ctrl : R/W; bitpos: [3]; default: 0;
         *  Set this bit to force software control can1 memory, disable hardware control.
         */
        uint32_t sys_can1_mem_force_ctrl:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} hp_system_can1_mem_lp_ctrl_reg_t;

/** Type of sys_cpu_acs_cache_mem_conf register
 *  CPU access Cache data mem configuration register
 */
typedef union {
    struct {
        /** sys_cpu_access_ac0_datamem_en : HRO; bitpos: [0]; default: 0;
         *  Set this bit to enable CPU accessROMCache0 data mem path
         */
        uint32_t sys_cpu_access_ac0_datamem_en:1;
        /** sys_cpu_access_ac1_datamem_en : HRO; bitpos: [1]; default: 0;
         *  Set this bit to enable CPU access ROMCache1 data mem path
         */
        uint32_t sys_cpu_access_ac1_datamem_en:1;
        /** sys_cpu_access_ic0_datamem_en : R/W; bitpos: [2]; default: 0;
         *  Set this bit to enable CPU access ICache0 data mem path
         */
        uint32_t sys_cpu_access_ic0_datamem_en:1;
        /** sys_cpu_access_ic1_datamem_en : R/W; bitpos: [3]; default: 0;
         *  Set this bit to enable CPU access ICache1 data mem path
         */
        uint32_t sys_cpu_access_ic1_datamem_en:1;
        /** sys_cpu_access_dc_datamem_en : R/W; bitpos: [4]; default: 0;
         *  Set this bit to enable CPU access DCache data mem path
         */
        uint32_t sys_cpu_access_dc_datamem_en:1;
        /** sys_cpu_acs_cache_mem_lock : R/W; bitpos: [5]; default: 0;
         *  Set 1 to lock cpu acs mem data mem path configuration
         */
        uint32_t sys_cpu_acs_cache_mem_lock:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_cpu_acs_cache_mem_conf_reg_t;

/** Type of sys_sdio_pad_bist_cfg register
 *  sdio pad bist control register
 */
typedef union {
    struct {
        /** sys_sdio_pad_bist_start : WT; bitpos: [0]; default: 0;
         *  Write 1 to start sdio pad bist
         */
        uint32_t sys_sdio_pad_bist_start:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_system_sdio_pad_bist_cfg_reg_t;

/** Type of sys_gmac0_pad_bist_cfg register
 *  gmac0 pad bist control register
 */
typedef union {
    struct {
        /** sys_gmac0_pad_bist_start : WT; bitpos: [0]; default: 0;
         *  Write 1 to start gmac0 pad bist
         */
        uint32_t sys_gmac0_pad_bist_start:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_system_gmac0_pad_bist_cfg_reg_t;

/** Type of sys_gmac1_pad_bist_cfg register
 *  gmac1 pad bist control register
 */
typedef union {
    struct {
        /** sys_gmac1_pad_bist_start : WT; bitpos: [0]; default: 0;
         *  Write 1 to start gmac1 pad bist
         */
        uint32_t sys_gmac1_pad_bist_start:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_system_gmac1_pad_bist_cfg_reg_t;


/** Group: configure_register */
/** Type of core_ibus_timeout_conf register
 *  need_des
 */
typedef union {
    struct {
        /** core_ibus_timeout_protect_en : R/W; bitpos: [0]; default: 1;
         *  set this field to 1 to enable hp core0&1 ibus timeout handle
         */
        uint32_t core_ibus_timeout_protect_en:1;
        /** core_ibus_timeout_thres : R/W; bitpos: [16:1]; default: 65535;
         *  This field used to set hp core0&1 ibus timeout  threshold
         */
        uint32_t core_ibus_timeout_thres:16;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_system_core_ibus_timeout_conf_reg_t;

/** Type of core_dbus_timeout_conf register
 *  need_des
 */
typedef union {
    struct {
        /** core_dbus_timeout_protect_en : R/W; bitpos: [0]; default: 1;
         *  set this field to 1 to enable hp core0&1 dbus timeout handle
         */
        uint32_t core_dbus_timeout_protect_en:1;
        /** core_dbus_timeout_thres : R/W; bitpos: [16:1]; default: 65535;
         *  This field used to set hp core0&1 dbus timeout  threshold
         */
        uint32_t core_dbus_timeout_thres:16;
        uint32_t reserved_17:15;
    };
    uint32_t val;
} hp_system_core_dbus_timeout_conf_reg_t;

/** Type of icm_h2x_cfg register
 *  need_des
 */
typedef union {
    struct {
        /** cpu_icm_h2x_post_wr_en : R/W; bitpos: [0]; default: 0;
         *  need_des
         */
        uint32_t cpu_icm_h2x_post_wr_en:1;
        /** cpu_icm_h2x_cut_through_en : R/W; bitpos: [1]; default: 1;
         *  need_des
         */
        uint32_t cpu_icm_h2x_cut_through_en:1;
        /** cpu_icm_h2x_bridge_busy : RO; bitpos: [2]; default: 0;
         *  need_des
         */
        uint32_t cpu_icm_h2x_bridge_busy:1;
        /** sdmmc_icm_h2x_post_wr_en : R/W; bitpos: [3]; default: 0;
         *  need_des
         */
        uint32_t sdmmc_icm_h2x_post_wr_en:1;
        /** sdmmc_icm_h2x_cut_through_en : R/W; bitpos: [4]; default: 1;
         *  need_des
         */
        uint32_t sdmmc_icm_h2x_cut_through_en:1;
        /** sdmmc_icm_h2x_bridge_busy : RO; bitpos: [5]; default: 0;
         *  need_des
         */
        uint32_t sdmmc_icm_h2x_bridge_busy:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_icm_h2x_cfg_reg_t;

/** Type of bitscrambler_peri_sel register
 *  Bitscrambler Peri Sel
 */
typedef union {
    struct {
        /** bitscrambler_peri_rx_sel : R/W; bitpos: [4:0]; default: 0;
         *  Set  this field to sel peri with DMA RX interface to connect with bitscrambler:
         *  lcd_cam: 5'h1, gpspi2: 5'h2: gpspi3: 5'h3, parl_io:5'h4, aes: 5'h5, sha: 5'h6, adc:
         *  5'h7, i2s0_ch0: 5'h8, i2s0_ch1: 5'h9, i2s0_ch2: 5'ha, i2s0_ch3: 5'hb,
         *  i2s1_ch0: 5'hc, i2s1_ch1: 5'hd, i2s1_ch2: 5'he, i2s1_ch3: 5'hf, uhci0: 5'h10, RMT:
         *  5'h11, none: else.
         */
        uint32_t bitscrambler_peri_rx_sel:5;
        /** bitscrambler_peri_tx_sel : R/W; bitpos: [9:5]; default: 0;
         *  Set  this field to sel peri with DMA TX interface to connect with bitscrambler:
         *  lcd_cam: 5'h1, gpspi2: 5'h2: gpspi3: 5'h3, parl_io:5'h4, aes: 5'h5, sha: 5'h6, adc:
         *  5'h7, i2s0_ch0: 5'h8, i2s0_ch1: 5'h9, i2s0_ch2: 5'ha, i2s0_ch3: 5'hb,
         *  i2s1_ch0: 5'hc, i2s1_ch1: 5'hd, i2s1_ch2: 5'he, i2s1_ch3: 5'hf, uhci0: 5'h10, RMT:
         *  5'h11, none: else.
         */
        uint32_t bitscrambler_peri_tx_sel:5;
        uint32_t reserved_10:22;
    };
    uint32_t val;
} hp_system_bitscrambler_peri_sel_reg_t;


/** Group: GDMA Ctonrol Register */
/** Type of sys_gdma_ctrl register
 *  N/A
 */
typedef union {
    struct {
        /** sys_debug_ch_num : R/W; bitpos: [1:0]; default: 0;
         *  N/A
         */
        uint32_t sys_debug_ch_num:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gdma_ctrl_reg_t;


/** Group: VPU Control Register */
/** Type of sys_vpu_ctrl register
 *  N/A
 */
typedef union {
    struct {
        /** sys_ppa_lslp_mem_pd : R/W; bitpos: [0]; default: 0;
         *  N/A
         */
        uint32_t sys_ppa_lslp_mem_pd:1;
        /** sys_jpeg_sdslp_mem_pd : R/W; bitpos: [1]; default: 0;
         *  N/A
         */
        uint32_t sys_jpeg_sdslp_mem_pd:1;
        /** sys_jpeg_lslp_mem_pd : R/W; bitpos: [2]; default: 0;
         *  N/A
         */
        uint32_t sys_jpeg_lslp_mem_pd:1;
        /** sys_jpeg_dslp_mem_pd : R/W; bitpos: [3]; default: 0;
         *  N/A
         */
        uint32_t sys_jpeg_dslp_mem_pd:1;
        /** sys_dma2d_lslp_mem_pd : R/W; bitpos: [4]; default: 0;
         *  N/A
         */
        uint32_t sys_dma2d_lslp_mem_pd:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} hp_system_vpu_ctrl_reg_t;


/** Group: HP_DESIGN_FOR_VERIFICATION0 */
/** Type of design_for_verification0 register
 *  need_des
 */
typedef union {
    struct {
        /** dfv0 : R/W; bitpos: [31:0]; default: 0;
         *  register for DV
         */
        uint32_t dfv0:32;
    };
    uint32_t val;
} hp_system_design_for_verification0_reg_t;


/** Group: HP_DESIGN_FOR_VERIFICATION1 */
/** Type of design_for_verification1 register
 *  need_des
 */
typedef union {
    struct {
        /** dfv1 : R/W; bitpos: [31:0]; default: 0;
         *  register for DV
         */
        uint32_t dfv1:32;
    };
    uint32_t val;
} hp_system_design_for_verification1_reg_t;


/** Group: Interrupt Registers */
/** Type of ahb2axi_bresp_err_int_raw register
 *  NA
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** sdmmc_icm_h2x_bresp_err_int_raw : R/WTC/SS; bitpos: [30]; default: 0;
         *  the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in
         *  post write mode in ahb2axi.
         */
        uint32_t sdmmc_icm_h2x_bresp_err_int_raw:1;
        /** cpu_icm_h2x_bresp_err_int_raw : R/WTC/SS; bitpos: [31]; default: 0;
         *  the raw interrupt status of bresp error,  triggered when if  bresp err occurs  in
         *  post write mode in ahb2axi.
         */
        uint32_t cpu_icm_h2x_bresp_err_int_raw:1;
    };
    uint32_t val;
} hp_system_ahb2axi_bresp_err_int_raw_reg_t;

/** Type of ahb2axi_bresp_err_int_st register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** sdmmc_icm_h2x_bresp_err_int_st : RO; bitpos: [30]; default: 0;
         *  the masked interrupt status of  sdmmc_icm_h2x_bresp_err
         */
        uint32_t sdmmc_icm_h2x_bresp_err_int_st:1;
        /** cpu_icm_h2x_bresp_err_int_st : RO; bitpos: [31]; default: 0;
         *  the masked interrupt status of  cpu_icm_h2x_bresp_err
         */
        uint32_t cpu_icm_h2x_bresp_err_int_st:1;
    };
    uint32_t val;
} hp_system_ahb2axi_bresp_err_int_st_reg_t;

/** Type of ahb2axi_bresp_err_int_ena register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** sdmmc_icm_h2x_bresp_err_int_ena : R/W; bitpos: [30]; default: 0;
         *  Write 1 to enable sdmmc_icm_h2x_bresp_err int
         */
        uint32_t sdmmc_icm_h2x_bresp_err_int_ena:1;
        /** cpu_icm_h2x_bresp_err_int_ena : R/W; bitpos: [31]; default: 0;
         *  Write 1 to enable cpu_icm_h2x_bresp_err int
         */
        uint32_t cpu_icm_h2x_bresp_err_int_ena:1;
    };
    uint32_t val;
} hp_system_ahb2axi_bresp_err_int_ena_reg_t;

