espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_struct.h
/** Type of ahb2axi_bresp_err_int_clr register
 *  need_des
 */
typedef union {
    struct {
        uint32_t reserved_0:30;
        /** sdmmc_icm_h2x_bresp_err_int_clr : WT; bitpos: [30]; default: 0;
         *  Write 1 to clear sdmmc_icm_h2x_bresp_err  int
         */
        uint32_t sdmmc_icm_h2x_bresp_err_int_clr:1;
        /** cpu_icm_h2x_bresp_err_int_clr : WT; bitpos: [31]; default: 0;
         *  Write 1 to clear cpu_icm_h2x_bresp_err  int
         */
        uint32_t cpu_icm_h2x_bresp_err_int_clr:1;
    };
    uint32_t val;
} hp_system_ahb2axi_bresp_err_int_clr_reg_t;

/** Type of core_timeout_int_raw register
 *  Hp core bus timeout interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** core0_ibus_timeout_int_raw : R/WTC/SS; bitpos: [2]; default: 0;
         *  the raw interrupt status of hp core0  ibus timeout
         */
        uint32_t core0_ibus_timeout_int_raw:1;
        /** core1_ibus_timeout_int_raw : R/WTC/SS; bitpos: [3]; default: 0;
         *  the raw interrupt status of hp core1  ibus timeout
         */
        uint32_t core1_ibus_timeout_int_raw:1;
        /** core0_dbus_timeout_int_raw : R/WTC/SS; bitpos: [4]; default: 0;
         *  the raw interrupt status of hp core0  dbus timeout
         */
        uint32_t core0_dbus_timeout_int_raw:1;
        /** core1_dbus_timeout_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  the raw interrupt status of hp core1  dbus timeout
         */
        uint32_t core1_dbus_timeout_int_raw:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_core_timeout_int_raw_reg_t;

/** Type of core_timeout_int_st register
 *  masked interrupt register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** core0_ibus_timeout_int_st : RO; bitpos: [2]; default: 0;
         *  the masked interrupt status of hp core0  ibus timeout
         */
        uint32_t core0_ibus_timeout_int_st:1;
        /** core1_ibus_timeout_int_st : RO; bitpos: [3]; default: 0;
         *  the masked interrupt status of hp core1  ibus timeout
         */
        uint32_t core1_ibus_timeout_int_st:1;
        /** core0_dbus_timeout_int_st : RO; bitpos: [4]; default: 0;
         *  the masked interrupt status of hp core0  dbus timeout
         */
        uint32_t core0_dbus_timeout_int_st:1;
        /** core1_dbus_timeout_int_st : RO; bitpos: [5]; default: 0;
         *  the masked interrupt status of hp core1  dbus timeout
         */
        uint32_t core1_dbus_timeout_int_st:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_core_timeout_int_st_reg_t;

/** Type of core_timeout_int_ena register
 *  masked interrupt register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** core0_ibus_timeout_int_ena : R/W; bitpos: [2]; default: 0;
         *  Write 1 to enable hp_system_core0_ibus_timeout int
         */
        uint32_t core0_ibus_timeout_int_ena:1;
        /** core1_ibus_timeout_int_ena : R/W; bitpos: [3]; default: 0;
         *  Write 1 to enable hp_system_core1_ibus_timeout int
         */
        uint32_t core1_ibus_timeout_int_ena:1;
        /** core0_dbus_timeout_int_ena : R/W; bitpos: [4]; default: 0;
         *  Write 1 to enable hp_system_core0_dbus_timeout int
         */
        uint32_t core0_dbus_timeout_int_ena:1;
        /** core1_dbus_timeout_int_ena : R/W; bitpos: [5]; default: 0;
         *  Write 1 to enable hp_system_core1_dbus_timeout int
         */
        uint32_t core1_dbus_timeout_int_ena:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_core_timeout_int_ena_reg_t;

/** Type of core_timeout_int_clr register
 *  interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:2;
        /** core0_ibus_timeout_int_clr : WT; bitpos: [2]; default: 0;
         *  Write 1 to clear hp_system_core0_ibus_timeout int
         */
        uint32_t core0_ibus_timeout_int_clr:1;
        /** core1_ibus_timeout_int_clr : WT; bitpos: [3]; default: 0;
         *  Write 1 to clear hp_system_core1_ibus_timeout int
         */
        uint32_t core1_ibus_timeout_int_clr:1;
        /** core0_dbus_timeout_int_clr : WT; bitpos: [4]; default: 0;
         *  Write 1 to clear hp_system_core0_dbus_timeout int
         */
        uint32_t core0_dbus_timeout_int_clr:1;
        /** core1_dbus_timeout_int_clr : WT; bitpos: [5]; default: 0;
         *  Write 1 to clear hp_system_core1_dbus_timeout int
         */
        uint32_t core1_dbus_timeout_int_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_core_timeout_int_clr_reg_t;

/** Type of sys_sdio_pad_bist_int_raw register
 *  sdio pad bist interrupt raw register
 */
typedef union {
    struct {
        /** sys_sdio_pad_bist_ok_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  intr triggered when bist finish and status is bist ok
         */
        uint32_t sys_sdio_pad_bist_ok_int_raw:1;
        /** sys_sdio_pad_bist_fail_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  intr triggered when bist finish and status is bist fail
         */
        uint32_t sys_sdio_pad_bist_fail_int_raw:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_sdio_pad_bist_int_raw_reg_t;

/** Type of sys_sdio_pad_bist_int_st register
 *  masked interrupt register
 */
typedef union {
    struct {
        /** sys_sdio_pad_bist_ok_int_st : RO; bitpos: [0]; default: 0;
         *  the masked interrupt status of sdio pad bist ok interrupt
         */
        uint32_t sys_sdio_pad_bist_ok_int_st:1;
        /** sys_sdio_pad_bist_fail_int_st : RO; bitpos: [1]; default: 0;
         *  the masked interrupt status of sdio pad bist fail interrupt
         */
        uint32_t sys_sdio_pad_bist_fail_int_st:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_sdio_pad_bist_int_st_reg_t;

/** Type of sys_sdio_pad_bist_int_ena register
 *  interrupt enable register
 */
typedef union {
    struct {
        /** sys_sdio_pad_bist_ok_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable sdio pad bist ok interrupt
         */
        uint32_t sys_sdio_pad_bist_ok_int_ena:1;
        /** sys_sdio_pad_bist_fail_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable sdio pad bist fail interrupt
         */
        uint32_t sys_sdio_pad_bist_fail_int_ena:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_sdio_pad_bist_int_ena_reg_t;

/** Type of sys_sdio_pad_bist_int_clr register
 *  interrupt clear register
 */
typedef union {
    struct {
        /** sys_sdio_pad_bist_ok_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clr sdio pad bist ok interrupt
         */
        uint32_t sys_sdio_pad_bist_ok_int_clr:1;
        /** sys_sdio_pad_bist_fail_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clr sdio pad bist fail interrupt
         */
        uint32_t sys_sdio_pad_bist_fail_int_clr:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_sdio_pad_bist_int_clr_reg_t;

/** Type of sys_gmac0_pad_bist_int_raw register
 *  gmac0 pad bist interrupt raw register
 */
typedef union {
    struct {
        /** sys_gmac0_pad_bist_ok_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  intr triggered when bist finish and status is bist ok
         */
        uint32_t sys_gmac0_pad_bist_ok_int_raw:1;
        /** sys_gmac0_pad_bist_fail_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  intr triggered when bist finish and status is bist fail
         */
        uint32_t sys_gmac0_pad_bist_fail_int_raw:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gmac0_pad_bist_int_raw_reg_t;

/** Type of sys_gmac0_pad_bist_int_st register
 *  masked interrupt register
 */
typedef union {
    struct {
        /** sys_gmac0_pad_bist_ok_int_st : RO; bitpos: [0]; default: 0;
         *  the masked interrupt status of gmac0 pad bist ok interrupt
         */
        uint32_t sys_gmac0_pad_bist_ok_int_st:1;
        /** sys_gmac0_pad_bist_fail_int_st : RO; bitpos: [1]; default: 0;
         *  the masked interrupt status of gmac0 pad bist fail interrupt
         */
        uint32_t sys_gmac0_pad_bist_fail_int_st:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gmac0_pad_bist_int_st_reg_t;

/** Type of sys_gmac0_pad_bist_int_ena register
 *  interrupt enable register
 */
typedef union {
    struct {
        /** sys_gmac0_pad_bist_ok_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable gmac0 pad bist ok interrupt
         */
        uint32_t sys_gmac0_pad_bist_ok_int_ena:1;
        /** sys_gmac0_pad_bist_fail_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable gmac0 pad bist fail interrupt
         */
        uint32_t sys_gmac0_pad_bist_fail_int_ena:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gmac0_pad_bist_int_ena_reg_t;

/** Type of sys_gmac0_pad_bist_int_clr register
 *  interrupt clear register
 */
typedef union {
    struct {
        /** sys_gmac0_pad_bist_ok_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clr gmac0 pad bist ok interrupt
         */
        uint32_t sys_gmac0_pad_bist_ok_int_clr:1;
        /** sys_gmac0_pad_bist_fail_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clr gmac0 pad bist fail interrupt
         */
        uint32_t sys_gmac0_pad_bist_fail_int_clr:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gmac0_pad_bist_int_clr_reg_t;

/** Type of sys_gmac1_pad_bist_int_raw register
 *  gmac1 pad bist interrupt raw register
 */
typedef union {
    struct {
        /** sys_gmac1_pad_bist_ok_int_raw : R/WTC/SS; bitpos: [0]; default: 0;
         *  intr triggered when bist finish and status is bist ok
         */
        uint32_t sys_gmac1_pad_bist_ok_int_raw:1;
        /** sys_gmac1_pad_bist_fail_int_raw : R/WTC/SS; bitpos: [1]; default: 0;
         *  intr triggered when bist finish and status is bist fail
         */
        uint32_t sys_gmac1_pad_bist_fail_int_raw:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gmac1_pad_bist_int_raw_reg_t;

