espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_struct.h
/** Type of sys_gmac1_pad_bist_int_st register
 *  masked interrupt register
 */
typedef union {
    struct {
        /** sys_gmac1_pad_bist_ok_int_st : RO; bitpos: [0]; default: 0;
         *  the masked interrupt status of gmac1 pad bist ok interrupt
         */
        uint32_t sys_gmac1_pad_bist_ok_int_st:1;
        /** sys_gmac1_pad_bist_fail_int_st : RO; bitpos: [1]; default: 0;
         *  the masked interrupt status of gmac1 pad bist fail interrupt
         */
        uint32_t sys_gmac1_pad_bist_fail_int_st:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gmac1_pad_bist_int_st_reg_t;

/** Type of sys_gmac1_pad_bist_int_ena register
 *  interrupt enable register
 */
typedef union {
    struct {
        /** sys_gmac1_pad_bist_ok_int_ena : R/W; bitpos: [0]; default: 0;
         *  Write 1 to enable gmac1 pad bist ok interrupt
         */
        uint32_t sys_gmac1_pad_bist_ok_int_ena:1;
        /** sys_gmac1_pad_bist_fail_int_ena : R/W; bitpos: [1]; default: 0;
         *  Write 1 to enable gmac1 pad bist fail interrupt
         */
        uint32_t sys_gmac1_pad_bist_fail_int_ena:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gmac1_pad_bist_int_ena_reg_t;

/** Type of sys_gmac1_pad_bist_int_clr register
 *  interrupt clear register
 */
typedef union {
    struct {
        /** sys_gmac1_pad_bist_ok_int_clr : WT; bitpos: [0]; default: 0;
         *  Write 1 to clr gmac1 pad bist ok interrupt
         */
        uint32_t sys_gmac1_pad_bist_ok_int_clr:1;
        /** sys_gmac1_pad_bist_fail_int_clr : WT; bitpos: [1]; default: 0;
         *  Write 1 to clr gmac1 pad bist fail interrupt
         */
        uint32_t sys_gmac1_pad_bist_fail_int_clr:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_gmac1_pad_bist_int_clr_reg_t;


/** Group: HP_CORE_DMACTIVE_LPCORE_REG */
/** Type of core_dmactive_lpcore register
 *  need_des
 */
typedef union {
    struct {
        /** core_dmactive_lpcore : RO; bitpos: [0]; default: 0;
         *  hp core dmactive_lpcore value
         */
        uint32_t core_dmactive_lpcore:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_system_core_dmactive_lpcore_reg_t;


/** Group: control registers */
/** Type of core_err_resp_dis register
 *  need_des
 */
typedef union {
    struct {
        /** core_err_resp_dis : R/W; bitpos: [2:0]; default: 0;
         *  Set bit0 to disable ibus err resp. Set bit1 to disable dbus err resp.  Set bit 2 to
         *  disable ahb err resp.
         */
        uint32_t core_err_resp_dis:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} hp_system_core_err_resp_dis_reg_t;

/** Type of sys_tcm_performace_ctrl register
 *  need_des
 */
typedef union {
    struct {
        /** sys_ahb_to_tcm_mem_en_hold : R/W; bitpos: [0]; default: 0;
         *  Set 1 to keep TCM mem enable hold when mem access is busy.
         */
        uint32_t sys_ahb_to_tcm_mem_en_hold:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} hp_system_tcm_performace_ctrl_reg_t;


/** Group: Timeout Register */
/** Type of sys_cpu_peri0_timeout_conf register
 *  CPU_PERI0_TIMEOUT configuration register
 */
typedef union {
    struct {
        /** sys_cpu_peri0_timeout_thres : R/W; bitpos: [15:0]; default: 65535;
         *  Configures the timeout threshold for bus access for accessing CPU peripheral0
         *  register in the number of clock cycles of the clock domain.
         */
        uint32_t sys_cpu_peri0_timeout_thres:16;
        /** sys_cpu_peri0_timeout_int_clr : WT; bitpos: [16]; default: 0;
         *  Write 1 to clear timeout interrupt.
         */
        uint32_t sys_cpu_peri0_timeout_int_clr:1;
        /** sys_cpu_peri0_timeout_protect_en : R/W; bitpos: [17]; default: 1;
         *  Configures whether or not to enable timeout protection for accessing CPU
         *  peripheral0 registers.
         *  0: Disable
         *  1: Enable
         */
        uint32_t sys_cpu_peri0_timeout_protect_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} hp_system_cpu_peri0_timeout_conf_reg_t;

/** Type of sys_cpu_peri0_timeout_addr register
 *  CPU_PERI0_TIMEOUT_ADDR register
 */
typedef union {
    struct {
        /** sys_cpu_peri0_timeout_addr : RO; bitpos: [31:0]; default: 0;
         *  Represents the address information of abnormal access.
         */
        uint32_t sys_cpu_peri0_timeout_addr:32;
    };
    uint32_t val;
} hp_system_cpu_peri0_timeout_addr_reg_t;

/** Type of sys_cpu_peri0_timeout_uid register
 *  CPU_PERI0_TIMEOUT_UID register
 */
typedef union {
    struct {
        /** sys_cpu_peri0_timeout_uid : RO; bitpos: [7:0]; default: 0;
         *  Represents the master id[5:0] and master permission[6:5] when trigger timeout. This
         *  register will be cleared after the interrupt is cleared.
         */
        uint32_t sys_cpu_peri0_timeout_uid:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_system_cpu_peri0_timeout_uid_reg_t;

/** Type of sys_hp_system_peri0_timeout_conf register
 *  HP_PERI0_TIMEOUT configuration register
 */
typedef union {
    struct {
        /** sys_hp_system_peri0_timeout_thres : R/W; bitpos: [15:0]; default: 65535;
         *  Configures the timeout threshold for bus access for accessing CPU peripheral
         *  register in the number of clock cycles of the clock domain.
         */
        uint32_t sys_hp_system_peri0_timeout_thres:16;
        /** sys_hp_system_peri0_timeout_int_clr : WT; bitpos: [16]; default: 0;
         *  Write 1 to clear timeout interrupt.
         */
        uint32_t sys_hp_system_peri0_timeout_int_clr:1;
        /** sys_hp_system_peri0_timeout_protect_en : R/W; bitpos: [17]; default: 1;
         *  Configures whether or not to enable timeout protection for accessing CPU peripheral
         *  registers.
         *  0: Disable
         *  1: Enable
         */
        uint32_t sys_hp_system_peri0_timeout_protect_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} hp_system_hp_system_peri0_timeout_conf_reg_t;

/** Type of sys_hp_system_peri0_timeout_addr register
 *  HP_PERI0_TIMEOUT_ADDR register
 */
typedef union {
    struct {
        /** sys_hp_system_peri0_timeout_addr : RO; bitpos: [31:0]; default: 0;
         *  Represents the address information of abnormal access.
         */
        uint32_t sys_hp_system_peri0_timeout_addr:32;
    };
    uint32_t val;
} hp_system_hp_system_peri0_timeout_addr_reg_t;

/** Type of sys_hp_system_peri0_timeout_uid register
 *  HP_PERI0_TIMEOUT_UID register
 */
typedef union {
    struct {
        /** sys_hp_system_peri0_timeout_uid : RO; bitpos: [7:0]; default: 0;
         *  Represents the master id[5:0] and master permission[6:5] when trigger timeout. This
         *  register will be cleared after the interrupt is cleared.
         */
        uint32_t sys_hp_system_peri0_timeout_uid:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_system_hp_system_peri0_timeout_uid_reg_t;

/** Type of sys_hp_system_peri1_timeout_conf register
 *  HP_PERI1_TIMEOUT configuration register
 */
typedef union {
    struct {
        /** sys_hp_system_peri1_timeout_thres : R/W; bitpos: [15:0]; default: 65535;
         *  Configures the timeout threshold for bus access for accessing CPU peripheral
         *  register in the number of clock cycles of the clock domain.
         */
        uint32_t sys_hp_system_peri1_timeout_thres:16;
        /** sys_hp_system_peri1_timeout_int_clr : WT; bitpos: [16]; default: 0;
         *  Write 1 to clear timeout interrupt.
         */
        uint32_t sys_hp_system_peri1_timeout_int_clr:1;
        /** sys_hp_system_peri1_timeout_protect_en : R/W; bitpos: [17]; default: 1;
         *  Configures whether or not to enable timeout protection for accessing CPU peripheral
         *  registers.
         *  0: Disable
         *  1: Enable
         */
        uint32_t sys_hp_system_peri1_timeout_protect_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} hp_system_hp_system_peri1_timeout_conf_reg_t;

/** Type of sys_hp_system_peri1_timeout_addr register
 *  HP_PERI1_TIMEOUT_ADDR register
 */
typedef union {
    struct {
        /** sys_hp_system_peri1_timeout_addr : RO; bitpos: [31:0]; default: 0;
         *  Represents the address information of abnormal access.
         */
        uint32_t sys_hp_system_peri1_timeout_addr:32;
    };
    uint32_t val;
} hp_system_hp_system_peri1_timeout_addr_reg_t;

/** Type of sys_hp_system_peri1_timeout_uid register
 *  HP_PERI1_TIMEOUT_UID register
 */
typedef union {
    struct {
        /** sys_hp_system_peri1_timeout_uid : RO; bitpos: [7:0]; default: 0;
         *  Represents the master id[5:0] and master permission[6:5] when trigger timeout. This
         *  register will be cleared after the interrupt is cleared.
         */
        uint32_t sys_hp_system_peri1_timeout_uid:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_system_hp_system_peri1_timeout_uid_reg_t;

/** Type of sys_cpu_peri1_timeout_conf register
 *  CPU_PERI1_TIMEOUT configuration register
 */
typedef union {
    struct {
        /** sys_cpu_peri1_timeout_thres : R/W; bitpos: [15:0]; default: 65535;
         *  Configures the timeout threshold for bus access for accessing CPU peripheral
         *  register in the number of clock cycles of the clock domain.
         */
        uint32_t sys_cpu_peri1_timeout_thres:16;
        /** sys_cpu_peri1_timeout_int_clr : WT; bitpos: [16]; default: 0;
         *  Write 1 to clear timeout interrupt.
         */
        uint32_t sys_cpu_peri1_timeout_int_clr:1;
        /** sys_cpu_peri1_timeout_protect_en : R/W; bitpos: [17]; default: 1;
         *  Configures whether or not to enable timeout protection for accessing CPU
         *  peripheral11 registers.
         *  0: Disable
         *  1: Enable
         */
        uint32_t sys_cpu_peri1_timeout_protect_en:1;
        uint32_t reserved_18:14;
    };
    uint32_t val;
} hp_system_cpu_peri1_timeout_conf_reg_t;

