espressif/esp-idf/components/soc/esp32s31/register/soc/hp_system_struct.h
/** Type of sys_cpu_peri1_timeout_addr register
 *  CPU_PERI1_TIMEOUT_ADDR register
 */
typedef union {
    struct {
        /** sys_cpu_peri1_timeout_addr : RO; bitpos: [31:0]; default: 0;
         *  Represents the address information of abnormal access.
         */
        uint32_t sys_cpu_peri1_timeout_addr:32;
    };
    uint32_t val;
} hp_system_cpu_peri1_timeout_addr_reg_t;

/** Type of sys_cpu_peri1_timeout_uid register
 *  CPU_PERI1_TIMEOUT_UID register
 */
typedef union {
    struct {
        /** sys_cpu_peri1_timeout_uid : RO; bitpos: [7:0]; default: 0;
         *  Represents the master id[5:0] and master permission[6:5] when trigger timeout. This
         *  register will be cleared after the interrupt is cleared.
         */
        uint32_t sys_cpu_peri1_timeout_uid:8;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} hp_system_cpu_peri1_timeout_uid_reg_t;


/** Group: Status Register */
/** Type of sys_sdio_pad_bist_st register
 *  sdio pad bist status register
 */
typedef union {
    struct {
        /** sys_sdio_pad_bist_rcnt : RO; bitpos: [5:0]; default: 0;
         *  Indicate number of clock cycles received for pad bist debug
         */
        uint32_t sys_sdio_pad_bist_rcnt:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_sdio_pad_bist_st_reg_t;

/** Type of sys_gmac0_pad_bist_st register
 *  gmac0 pad bist status register
 */
typedef union {
    struct {
        /** sys_gmac0_pad_bist_rcnt : RO; bitpos: [5:0]; default: 0;
         *  Indicate number of clock cycles received for pad bist debug
         */
        uint32_t sys_gmac0_pad_bist_rcnt:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_gmac0_pad_bist_st_reg_t;

/** Type of sys_gmac1_pad_bist_st register
 *  gmac1 pad bist status register
 */
typedef union {
    struct {
        /** sys_gmac1_pad_bist_rcnt : RO; bitpos: [5:0]; default: 0;
         *  Indicate number of clock cycles received for pad bist debug
         */
        uint32_t sys_gmac1_pad_bist_rcnt:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} hp_system_gmac1_pad_bist_st_reg_t;

/** Type of sys_cpu_pwait_mode register
 *  Indicate status of core0 and core1 pwait
 */
typedef union {
    struct {
        /** sys_cpu_pwait_mode : RO; bitpos: [1:0]; default: 0;
         *  Indicate status of core0 and core1 pwait
         */
        uint32_t sys_cpu_pwait_mode:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} hp_system_cpu_pwait_mode_reg_t;


typedef struct {
    volatile hp_system_ver_date_reg_t sys_ver_date;
    volatile hp_system_clk_en_reg_t clk_en;
    uint32_t reserved_008[2];
    volatile hp_system_cpu_int_from_cpu_0_reg_t cpu_int_from_cpu_0;
    volatile hp_system_cpu_int_from_cpu_1_reg_t cpu_int_from_cpu_1;
    volatile hp_system_cpu_int_from_cpu_2_reg_t cpu_int_from_cpu_2;
    volatile hp_system_cpu_int_from_cpu_3_reg_t cpu_int_from_cpu_3;
    uint32_t reserved_020[2];
    volatile hp_system_modem_diag_en_reg_t modem_diag_en;
    uint32_t reserved_02c[4];
    volatile hp_system_tcm_ram_pwr_ctrl0_reg_t tcm_ram_pwr_ctrl0;
    volatile hp_system_rom_pwr_ctrl0_reg_t rom_pwr_ctrl0;
    uint32_t reserved_044[3];
    volatile hp_system_probea_ctrl_reg_t probea_ctrl;
    volatile hp_system_probeb_ctrl_reg_t probeb_ctrl;
    uint32_t reserved_058;
    volatile hp_system_probe_out_reg_t probe_out;
    uint32_t reserved_060;
    volatile hp_system_cpu_corestalled_st_reg_t cpu_corestalled_st;
    uint32_t reserved_068[2];
    volatile hp_system_crypto_ctrl_reg_t crypto_ctrl;
    uint32_t reserved_074[2];
    volatile hp_system_iomux_fpga_debug_reg_t iomux_fpga_debug;
    volatile hp_system_rdn_eco_cs_reg_t sys_rdn_eco_cs;
    uint32_t reserved_084[24];
    volatile hp_system_tcm_rdn_eco_cs_reg_t tcm_rdn_eco_cs;
    volatile hp_system_tcm_rdn_eco_low_reg_t tcm_rdn_eco_low;
    volatile hp_system_tcm_rdn_eco_high_reg_t tcm_rdn_eco_high;
    uint32_t reserved_0f0[8];
    volatile hp_system_cache_pwr_ctrl_reg_t cache_pwr_ctrl;
    volatile hp_system_tcm_data_dump_ctrl_reg_t tcm_data_dump_ctrl;
    volatile hp_system_cpu_waiti_conf_reg_t cpu_waiti_conf;
    volatile hp_system_core_debug_runstall_conf_reg_t sys_core_debug_runstall_conf;
    uint32_t reserved_120;
    volatile hp_system_core_ibus_timeout_conf_reg_t core_ibus_timeout_conf;
    volatile hp_system_core_dbus_timeout_conf_reg_t core_dbus_timeout_conf;
    uint32_t reserved_12c[3];
    volatile hp_system_icm_h2x_cfg_reg_t icm_h2x_cfg;
    uint32_t reserved_13c;
    volatile hp_system_bitscrambler_peri_sel_reg_t bitscrambler_peri_sel;
    uint32_t reserved_144;
    volatile hp_system_gdma_ctrl_reg_t sys_gdma_ctrl;
    uint32_t reserved_14c[3];
    volatile hp_system_vpu_ctrl_reg_t sys_vpu_ctrl;
    uint32_t reserved_15c[5];
    volatile hp_system_design_for_verification0_reg_t design_for_verification0;
    volatile hp_system_design_for_verification1_reg_t design_for_verification1;
    uint32_t reserved_178[4];
    volatile hp_system_ahb2axi_bresp_err_int_raw_reg_t ahb2axi_bresp_err_int_raw;
    volatile hp_system_ahb2axi_bresp_err_int_st_reg_t ahb2axi_bresp_err_int_st;
    volatile hp_system_ahb2axi_bresp_err_int_ena_reg_t ahb2axi_bresp_err_int_ena;
    volatile hp_system_ahb2axi_bresp_err_int_clr_reg_t ahb2axi_bresp_err_int_clr;
    uint32_t reserved_198[2];
    volatile hp_system_core_dmactive_lpcore_reg_t core_dmactive_lpcore;
    volatile hp_system_core_err_resp_dis_reg_t core_err_resp_dis;
    volatile hp_system_core_timeout_int_raw_reg_t core_timeout_int_raw;
    volatile hp_system_core_timeout_int_st_reg_t core_timeout_int_st;
    volatile hp_system_core_timeout_int_ena_reg_t core_timeout_int_ena;
    volatile hp_system_core_timeout_int_clr_reg_t core_timeout_int_clr;
    volatile hp_system_core_pad_wakeup_event_reg_t core_pad_wakeup_event;
    uint32_t reserved_1bc;
    volatile hp_system_twai0_timestamp_l_reg_t twai0_timestamp_l;
    volatile hp_system_twai0_timestamp_h_reg_t twai0_timestamp_h;
    volatile hp_system_twai1_timestamp_l_reg_t twai1_timestamp_l;
    volatile hp_system_twai1_timestamp_h_reg_t twai1_timestamp_h;
    uint32_t reserved_1d0[2];
    volatile hp_system_rng_cfg_reg_t rng_cfg;
    uint32_t reserved_1dc;
    volatile hp_system_peri_mem_clk_force_on_reg_t peri_mem_clk_force_on;
    uint32_t reserved_1e4;
    volatile hp_system_prdyn_st_reg_t sys_prdyn_st;
    volatile hp_system_icm_cfg_reg_t sys_icm_cfg;
    volatile hp_system_uart3_mem_lp_ctrl_reg_t sys_uart3_mem_lp_ctrl;
    uint32_t reserved_1f4[4];
    volatile hp_system_rmt_mem_lp_ctrl_reg_t sys_rmt_mem_lp_ctrl;
    volatile hp_system_ledc0_mem_lp_ctrl_reg_t sys_ledc0_mem_lp_ctrl;
    volatile hp_system_km_mem_lp_ctrl_reg_t sys_km_mem_lp_ctrl;
    volatile hp_system_dma2d_mem_lp_ctrl_reg_t sys_dma2d_mem_lp_ctrl;
    volatile hp_system_axi_pdma_mem_lp_ctrl_reg_t sys_axi_pdma_mem_lp_ctrl;
    volatile hp_system_ecc_mem_lp_ctrl_reg_t sys_ecc_mem_lp_ctrl;
    volatile hp_system_rsa_mem_lp_ctrl_reg_t sys_rsa_mem_lp_ctrl;
    volatile hp_system_bitscram_mem_lp_ctrl_reg_t sys_bitscram_mem_lp_ctrl;
    uint32_t reserved_224;
    volatile hp_system_can0_mem_lp_ctrl_reg_t sys_can0_mem_lp_ctrl;
    uint32_t reserved_22c[2];
    volatile hp_system_mspi_mem_lp_ctrl_reg_t sys_mspi_mem_lp_ctrl;
    uint32_t reserved_238[5];
    volatile hp_system_hpcore_mem_lp_ctrl_reg_t sys_hpcore_mem_lp_ctrl;
    volatile hp_system_rom_mem_lp_ctrl_reg_t sys_rom_mem_lp_ctrl;
    uint32_t reserved_254[2];
    volatile hp_system_l1_cache_mem_lp_ctrl_reg_t sys_l1_cache_mem_lp_ctrl;
    volatile hp_system_kyber_mem_lp_ctrl_reg_t sys_kyber_mem_lp_ctrl;
    volatile hp_system_lcdcam_mem_lp_ctrl_reg_t sys_lcdcam_mem_lp_ctrl;
    volatile hp_system_cpu_peri0_timeout_conf_reg_t sys_cpu_peri0_timeout_conf;
    volatile hp_system_cpu_peri0_timeout_addr_reg_t sys_cpu_peri0_timeout_addr;
    volatile hp_system_cpu_peri0_timeout_uid_reg_t sys_cpu_peri0_timeout_uid;
    volatile hp_system_hp_system_peri0_timeout_conf_reg_t sys_hp_system_peri0_timeout_conf;
    volatile hp_system_hp_system_peri0_timeout_addr_reg_t sys_hp_system_peri0_timeout_addr;
    volatile hp_system_hp_system_peri0_timeout_uid_reg_t sys_hp_system_peri0_timeout_uid;
    volatile hp_system_hp_system_peri1_timeout_conf_reg_t sys_hp_system_peri1_timeout_conf;
    volatile hp_system_hp_system_peri1_timeout_addr_reg_t sys_hp_system_peri1_timeout_addr;
    volatile hp_system_hp_system_peri1_timeout_uid_reg_t sys_hp_system_peri1_timeout_uid;
    volatile hp_system_uart0_mem_lp_ctrl_reg_t sys_uart0_mem_lp_ctrl;
    volatile hp_system_uart1_mem_lp_ctrl_reg_t sys_uart1_mem_lp_ctrl;
    volatile hp_system_uart2_mem_lp_ctrl_reg_t sys_uart2_mem_lp_ctrl;
    volatile hp_system_ledc1_mem_lp_ctrl_reg_t sys_ledc1_mem_lp_ctrl;
    volatile hp_system_ppa_mem_lp_ctrl_reg_t sys_ppa_mem_lp_ctrl;
    volatile hp_system_jpeg_mem_lp_ctrl_reg_t sys_jpeg_mem_lp_ctrl;
    volatile hp_system_can1_mem_lp_ctrl_reg_t sys_can1_mem_lp_ctrl;
    volatile hp_system_cpu_peri1_timeout_conf_reg_t sys_cpu_peri1_timeout_conf;
    volatile hp_system_cpu_peri1_timeout_addr_reg_t sys_cpu_peri1_timeout_addr;
    volatile hp_system_cpu_peri1_timeout_uid_reg_t sys_cpu_peri1_timeout_uid;
    volatile hp_system_cpu_acs_cache_mem_conf_reg_t sys_cpu_acs_cache_mem_conf;
    uint32_t reserved_2b8[10];
    volatile hp_system_tcm_performace_ctrl_reg_t sys_tcm_performace_ctrl;
    volatile hp_system_sdio_pad_bist_cfg_reg_t sys_sdio_pad_bist_cfg;
    volatile hp_system_sdio_pad_bist_int_raw_reg_t sys_sdio_pad_bist_int_raw;
    volatile hp_system_sdio_pad_bist_int_st_reg_t sys_sdio_pad_bist_int_st;
    volatile hp_system_sdio_pad_bist_int_ena_reg_t sys_sdio_pad_bist_int_ena;
    volatile hp_system_sdio_pad_bist_int_clr_reg_t sys_sdio_pad_bist_int_clr;
    volatile hp_system_sdio_pad_bist_st_reg_t sys_sdio_pad_bist_st;
    volatile hp_system_gmac0_pad_bist_cfg_reg_t sys_gmac0_pad_bist_cfg;
    volatile hp_system_gmac0_pad_bist_int_raw_reg_t sys_gmac0_pad_bist_int_raw;
    volatile hp_system_gmac0_pad_bist_int_st_reg_t sys_gmac0_pad_bist_int_st;
    volatile hp_system_gmac0_pad_bist_int_ena_reg_t sys_gmac0_pad_bist_int_ena;
    volatile hp_system_gmac0_pad_bist_int_clr_reg_t sys_gmac0_pad_bist_int_clr;
    volatile hp_system_gmac0_pad_bist_st_reg_t sys_gmac0_pad_bist_st;
    volatile hp_system_gmac1_pad_bist_cfg_reg_t sys_gmac1_pad_bist_cfg;
    volatile hp_system_gmac1_pad_bist_int_raw_reg_t sys_gmac1_pad_bist_int_raw;
    volatile hp_system_gmac1_pad_bist_int_st_reg_t sys_gmac1_pad_bist_int_st;
    volatile hp_system_gmac1_pad_bist_int_ena_reg_t sys_gmac1_pad_bist_int_ena;
    volatile hp_system_gmac1_pad_bist_int_clr_reg_t sys_gmac1_pad_bist_int_clr;
    volatile hp_system_gmac1_pad_bist_st_reg_t sys_gmac1_pad_bist_st;
    uint32_t reserved_32c[3];
    volatile hp_system_cpu_pwait_mode_reg_t sys_cpu_pwait_mode;
} hp_system_dev_t;

extern hp_system_dev_t HP_SYSTEM;

#ifndef __cplusplus
_Static_assert(sizeof(hp_system_dev_t) == 0x33c, "Invalid size of hp_system_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
